Ran Plan for project: `infrastructure` dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_s3_bucket.example: Refreshing state... [id=my-tf-test-bucket23412412341234]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.example must be replaced
-/+ resource "aws_s3_bucket" "example" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
!       arn                         = "arn:aws:s3:::my-tf-test-bucket23412412341234" -> (known after apply)
!       bucket                      = "my-tf-test-bucket23412412341234" -> "my-tf-test-bucket2341241234123411" # forces replacement
!       bucket_domain_name          = "my-tf-test-bucket23412412341234.s3.amazonaws.com" -> (known after apply)
+       bucket_prefix               = (known after apply)
!       bucket_regional_domain_name = "my-tf-test-bucket23412412341234.s3.us-east-1.amazonaws.com" -> (known after apply)
!       hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
!       id                          = "my-tf-test-bucket23412412341234" -> (known after apply)
!       object_lock_enabled         = false -> (known after apply)
+       policy                      = (known after apply)
!       region                      = "us-east-1" -> (known after apply)
!       request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "Dev"
            "Name"        = "My bucket"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

!       cors_rule (known after apply)

!       grant (known after apply)
-       grant {
-           id          = "e5129f359582cfc59928beef170971d91af13e06ad8985eb859dd4f31d54381d" -> null
-           permissions = [
-               "FULL_CONTROL",
            ] -> null
-           type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

!       lifecycle_rule (known after apply)

!       logging (known after apply)

!       object_lock_configuration (known after apply)

!       replication_configuration (known after apply)

!       server_side_encryption_configuration (known after apply)
-       server_side_encryption_configuration {
-           rule {
-               bucket_key_enabled = false -> null

-               apply_server_side_encryption_by_default {
-                   sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

!       versioning (known after apply)
-       versioning {
-           enabled    = false -> null
-           mfa_delete = false -> null
        }

!       website (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p infrastructure
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.0170170.xyz/lock?id=everton-estudos-org%252Faws-nsse-iac%252Fterraform%252Fdefault%252Finfrastructure)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p infrastructure
  ```
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```